# Advanced Dataframes Lesson

In [1]:
import pandas as pd
import numpy as np

In [2]:
np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

# the input is a dictionary...or a labeled list
df

       name  math  english  reading classroom
0     Sally    62       85       80         A
1      Jane    88       79       67         B
2     Suzie    94       74       95         A
3     Billy    98       96       88         B
4       Ada    77       92       98         A
5      John    79       76       93         B
6    Thomas    82       64       81         A
7     Marie    93       63       90         A
8    Albert    92       62       87         A
9   Richard    69       80       94         A
10    Isaac    92       99       93         B
11     Alan    92       62       72         A

- What does each row of data represent?
    -An individual student record of their grades and classroom
    
 - We should ask this question frequently when working with a data frame
 
 - What is the datatype of students? It is a list of strings.
 
 - Grades datatype is a numpy array

## Creating Dataframes

### From Lists and Dictionaries

In [3]:
pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

   A  B
0  1  4
1  2  5
2  3  6

In [4]:
pd.DataFrame([[1, 2, 3], [4, 5, 6]])

   0  1  2
0  1  2  3
1  4  5  6

In [5]:
data = np.array([[1, 2, 3], [4, 5, 6]])

pd.DataFrame(data, columns=['a', 'b', 'c'])

   a  b  c
0  1  2  3
1  4  5  6

### From Text Files & Other Handy Functions for Reading Data

- read_csv is the most common used function to obtain data from an external txt file
    - pd.read_csv("filename.csv")
    - pd.read_excel("filename.xlsx")
- read_table is also common
    - pd.read_table
- read_json works for less structured files that are still tabular
    - pd.read_json("filename.json")
- read SQL   
    - pd.read_sql
- read from clipboard
    - pd.read_clipboard()

### From SQL

In [6]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'
    
query = """
    SELECT * FROM employees limit 10
"""

pd.read_sql(query, url)

ModuleNotFoundError: No module named 'env'